# app/utils/test_content.py

QUESTIONS = [
    {
        "text": (
            "<b>1/12.</b> Если бы в мире пропал интернет, чем бы ты хотел заниматься?\n\n"
            "<b>А)</b> Попытался бы восстановить систему и вернуть людям сеть.\n"
            "<b>Б)</b> Помогал бы людям, которые тяжело переживают отсутствие интернета.\n"
            "<b>В)</b> Сконцентрировался бы на машинах и производстве, так как без сети они перестали бы работать."
        ),
        "answers": [
            {"text": "Вариант А", "data": "1_A"},
            {"text": "Вариант Б", "data": "1_B"},
            {"text": "Вариант В", "data": "1_C"},
        ]
    },
    {
        "text": (
            "<b>2/12.</b> У тебя есть шанс позвонить одному из знаменитых людей, которые могли бы тебя чему-то научить. Кому бы ты позвонил?\n\n"
            "<b>А)</b> Знаменитому актёру\n"
            "<b>Б)</b> Учёному-зоологу\n"
            "<b>В)</b> Создателю приложения Telegram"
        ),
        "answers": [
            {"text": "Вариант А", "data": "2_A"},
            {"text": "Вариант Б", "data": "2_B"},
            {"text": "Вариант В", "data": "2_C"},
        ]
    },
    {
        "text": (
            "<b>3/12.</b> Представь, что мы живём во вселенной, где космос открыт для всех. Какую задачу ты бы взял на себя?\n\n"
            "<b>А)</b> Космо-актёр: снимался бы в фильмах о путешествиях в космосе.\n"
            "<b>Б)</b> Космо-зоолог: лечил бы животных и помогал выращивать овощи.\n"
            "<b>В)</b> Космо-экономист: выстраивал бы экономику и участвовал в политике."
        ),
        "answers": [
            {"text": "Вариант А", "data": "3_A"},
            {"text": "Вариант Б", "data": "3_B"},
            {"text": "Вариант В", "data": "3_C"},
        ]
    },
    {
        "text": (
            "<b>4/12.</b> Ты попал в видеоигру. Кем ты в ней будешь?\n\n"
            "<b>А)</b> Разработчиком: программировал бы игру изнутри.\n"
            "<b>Б)</b> Инженером: строил бы технику и развивал инженерные направления.\n"
            "<b>В)</b> Правителем: построил бы империю со своим социальным укладом."
        ),
        "answers": [
            {"text": "Вариант А", "data": "4_A"},
            {"text": "Вариант Б", "data": "4_B"},
            {"text": "Вариант В", "data": "4_C"},
        ]
    },
    {
        "text": (
            "<b>5/12.</b> Если бы у тебя был шанс что-то создать, что бы это было?\n\n"
            "<b>А)</b> Нарисовал бы картину, которая вдохновила бы людей во всём мире.\n"
            "<b>Б)</b> Спроектировал бы робота, который помогал бы людям.\n"
            "<b>В)</b> Вырастил бы растение, чтобы люди больше не знали голода."
        ),
        "answers": [
            {"text": "Вариант А", "data": "5_A"},
            {"text": "Вариант Б", "data": "5_B"},
            {"text": "Вариант В", "data": "5_C"},
        ]
    },
    {
        "text": (
            "<b>6/12.</b> Если бы ты стал врачом, кого бы ты лечил в первую очередь?\n\n"
            "<b>А)</b> Лечил бы людей.\n"
            "<b>Б)</b> Лечил бы животных."
        ),
        "answers": [
            {"text": "Вариант А", "data": "6_A"},
            {"text": "Вариант Б", "data": "6_B"},
        ]
    },
    {
        "text": (
            "<b>7/12.</b> Если бы деньги перестали играть какую-либо роль, кем бы ты хотел работать?\n\n"
            "<b>А)</b> Творцом: актёром, художником, режиссёром или писателем.\n"
            "<b>Б)</b> Лидером: политиком, юристом или государственным деятелем.\n"
            "<b>В)</b> Хранителем природы: ухаживал бы за растениями и животными."
        ),
        "answers": [
            {"text": "Вариант А", "data": "7_A"},
            {"text": "Вариант Б", "data": "7_B"},
            {"text": "Вариант В", "data": "7_C"},
        ]
    },
    {
        "text": (
            "<b>8/12.</b> Какое место для тебя более привлекательно?\n\n"
            "<b>А)</b> Шумная компания, где можно пообщаться и познакомиться.\n"
            "<b>Б)</b> Спокойный офис для исследований и разработок.\n"
            "<b>В)</b> Уютный домик в лесу или у моря."
        ),
        "answers": [
            {"text": "Вариант А", "data": "8_A"},
            {"text": "Вариант Б", "data": "8_B"},
            {"text": "Вариант В", "data": "8_C"},
        ]
    },
    {
        "text": (
            "<b>9/12.</b> В какое место ты бы пошёл на недельную стажировку?\n\n"
            "<b>А)</b> В зоопарк, сад или на ферму.\n"
            "<b>Б)</b> В суд, парламент или госучреждение.\n"
            "<b>В)</b> В архитектурное бюро или IT-компанию."
        ),
        "answers": [
            {"text": "Вариант А", "data": "9_A"},
            {"text": "Вариант Б", "data": "9_B"},
            {"text": "Вариант В", "data": "9_C"},
        ]
    },
    {
        "text": (
            "<b>10/12.</b> Что бы ты сделал первым делом на необитаемом острове?\n\n"
            "<b>А)</b> Нарисовал бы карту и придумал легенду.\n"
            "<b>Б)</b> Изучал бы животных и растения, чтобы выжить.\n"
            "<b>В)</b> Построил бы укрытие и удобные инструменты."
        ),
        "answers": [
            {"text": "Вариант А", "data": "10_A"},
            {"text": "Вариант Б", "data": "10_B"},
            {"text": "Вариант В", "data": "10_C"},
        ]
    },
    {
        "text": (
            "<b>11/12.</b> Представь, что ты оказался в прошлом. Кем бы ты стал?\n\n"
            "<b>А)</b> Артистом или комиком при дворе.\n"
            "<b>Б)</b> Лекарем или садовником в деревне.\n"
            "<b>В)</b> Изобретателем новых устройств."
        ),
        "answers": [
            {"text": "Вариант А", "data": "11_A"},
            {"text": "Вариант Б", "data": "11_B"},
            {"text": "Вариант В", "data": "11_C"},
        ]
    },
    {
        "text": (
            "<b>12/12.</b> Представь, что ты живёшь в будущем. Кем бы ты хотел стать?\n\n"
            "<b>А)</b> Создателем виртуальных миров.\n"
            "<b>Б)</b> Политиком, дипломатом или президентом.\n"
            "<b>В)</b> Экономистом или главным банкиром."
        ),
        "answers": [
            {"text": "Вариант А", "data": "12_A"},
            {"text": "Вариант Б", "data": "12_B"},
            {"text": "Вариант В", "data": "12_C"},
        ]
    }
]

# Ключ для подсчета баллов
SCORING_KEY = {
    'nature': ['2_B', '3_B', '5_C', '6_B', '7_C', '8_C', '9_A', '10_B', '11_B'],
    'tech': ['1_C', '4_B', '5_B', '8_B', '10_C', '11_C', '12_A'],
    'human': ['1_B', '4_C', '6_A', '7_B', '8_A', '9_B', '11_B', '12_B'], # 7(Б) и 11(Б) относятся к двум категориям
    'sign': ['1_A', '2_C', '3_C', '4_A', '8_B', '9_C', '12_C'],
    'art': ['2_A', '3_A', '5_A', '7_A', '8_C', '10_A', '11_A']
}

# Описание шкал и примеры профессий
SCALES_INFO = {
    'human': {
        'title': 'Человек – человек',
        'description': 'Ты отлично чувствуешь других людей, умеешь слушать и находить подход к каждому. Тебе подходит всё, где важны общение, помощь, вдохновение и командная работа.',
        'professions': ['Врач', 'Психолог-консультант', 'Юрист', 'учитель', 'Менеджер']
    },
    'nature': {
        'title': 'Человек – живая природа',
        'description': 'Ты внимателен, терпелив и наблюдателен. Тебе близок мир природы — животные, растения, всё живое вокруг.',
        'professions': ['Биолог', 'Ветеринар', 'Агроном', 'Зоолог', 'Микробиолог', 'Специалист по сельскому хозяйству']
    },
    'tech': {
        'title': 'Человек – техника',
        'description': 'Ты понимаешь, как устроены механизмы и технологии. Любишь логику, точность и всё, что можно разобрать и собрать заново. Это качество настоящих инженеров, разработчиков и изобретателей.',
        'professions': ['Инженер','Инженер-механик', 'Специалист по робототехнике', 'Электрослесарь', 'Технолог', 'Техник']
    },
    'sign': {
        'title': 'Человек – знаковая система',
        'description': 'Работа с символами, числами, текстами и информацией. Важны усидчивость, внимательность, логика и хорошая память.',
        'professions': ['Программист', 'Системный аналитик', 'Бухгалтер', 'Экономист', 'Картограф', 'Математик']
    },
    'art': {
        'title': 'Человек – художественный образ (Творческий потенциал)',
        'description': 'Вы креативны и умеете видеть красоту. Творчество — ваш источник вдохновения!',
        'professions': ['Актёр', 'Режиссёр', 'Дизайнер', 'Архитектор', 'Художник-живописец', 'Музыкант']
    }
}